Public Attributes | List of all members
API_SlabQuantity Struct Reference
Element Manager API
Describes the different calculated values for slabs. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | bottomSurface
bottom surface of the slab
double  | topSurface
top surface of the slab
double  | edgeSurface
surface of the edges of the slab
double  | bottomSurface_cond
conditional bottom surface of the slab
double  | topSurface_cond
conditional top surface of the slab
double  | volume
volume of the slab
double  | volume_cond
conditional volume of the slab
double  | perimeter
perimeter of the slab
double  | holesSurf
total area of holes in the slab
double  | holesPrm
total perimeter of holes in the slab
double  | grossBotSurf
Gross surface of the slab bottom.
double  | grossTopSurf
Gross surface of the slab top.
double  | grossEdgeSurf
Gross surface of the slab edges.
double  | grossVolume
Gross volume of the slab.
double  | grossBotSurfWithHoles
Gross surface of the slab bottom with holes.
double  | grossTopSurfWithHoles
Gross surface of the slab top with holes.
double  | grossEdgeSurfWithHoles
Gross surface of the slab edges with holes.
double  | grossVolumeWithHoles
Gross volume of the slab with holes.
Detailed Description
Describes the different calculated values for slabs.
Remarks
See also the slab parameters for listing in Appendix A of the GDL Reference manual.
Member Data Documentation
◆ bottomSurface
 API_SlabQuantity::bottomSurface
bottom surface of the slab
◆ bottomSurface_cond
 API_SlabQuantity::bottomSurface_cond
conditional bottom surface of the slab
◆ edgeSurface
 API_SlabQuantity::edgeSurface
surface of the edges of the slab
◆ grossBotSurf
 API_SlabQuantity::grossBotSurf
Gross surface of the slab bottom.
◆ grossBotSurfWithHoles
 API_SlabQuantity::grossBotSurfWithHoles
Gross surface of the slab bottom with holes.
◆ grossEdgeSurf
 API_SlabQuantity::grossEdgeSurf
Gross surface of the slab edges.
◆ grossEdgeSurfWithHoles
 API_SlabQuantity::grossEdgeSurfWithHoles
Gross surface of the slab edges with holes.
◆ grossTopSurf
 API_SlabQuantity::grossTopSurf
Gross surface of the slab top.
◆ grossTopSurfWithHoles
 API_SlabQuantity::grossTopSurfWithHoles
Gross surface of the slab top with holes.
◆ grossVolume
 API_SlabQuantity::grossVolume
Gross volume of the slab.
◆ grossVolumeWithHoles
 API_SlabQuantity::grossVolumeWithHoles
Gross volume of the slab with holes.
◆ holesPrm
 API_SlabQuantity::holesPrm
total perimeter of holes in the slab
◆ holesSurf
 API_SlabQuantity::holesSurf
total area of holes in the slab
◆ perimeter
 API_SlabQuantity::perimeter
perimeter of the slab
◆ topSurface
 API_SlabQuantity::topSurface
top surface of the slab
◆ topSurface_cond
 API_SlabQuantity::topSurface_cond
conditional top surface of the slab
◆ volume
 API_SlabQuantity::volume
volume of the slab
◆ volume_cond
 API_SlabQuantity::volume_cond
conditional volume of the slab